bpmn-processor-play/test/jmeter/performance.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.1.1 r1855137">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Performance test plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="host" elementType="Argument">
            <stringProp name="Argument.name">host</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="port" elementType="Argument">
            <stringProp name="Argument.name">port</stringProp>
            <stringProp name="Argument.value">9000</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="realm" elementType="Argument">
            <stringProp name="Argument.name">realm</stringProp>
            <stringProp name="Argument.value">realmx</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="id" elementType="Argument">
            <stringProp name="Argument.name">id</stringProp>
            <stringProp name="Argument.value">reativacao-test</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(count, 5000)}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(users, 1)}</stringProp>
        <longProp name="ThreadGroup.start_time">1471985067000</longProp>
        <longProp name="ThreadGroup.end_time">1456412080000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">3600</stringProp>
        <stringProp name="ThreadGroup.delay">1</stringProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Realm</stringProp>
              <stringProp name="Header.value">${realm}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Fire" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
        &quot;through&quot;: &quot;sky-reactivation-importer&quot;,&#xd;
        &quot;realmId&quot;: &quot;4eef99f3-f6f9-46ee-9e35-afe74ac1dcf1&quot;,&#xd;
        &quot;when&quot;: &quot;2019-05-22T00:00:00.000Z&quot;,&#xd;
        &quot;processedAt&quot;: &quot;2019-07-04T19:52:32.640Z&quot;,&#xd;
        &quot;eventType&quot;: &quot;CustomerCanceledContract&quot;,&#xd;
        &quot;id&quot;: &quot;0c24b315-67eb-4862-b775-58961164e537&quot;,&#xd;
        &quot;context&quot;: {&#xd;
            &quot;unstruct&quot;: {&#xd;
                &quot;flagFid&quot;: &quot;0&quot;,&#xd;
                &quot;quarter&quot;: null,&#xd;
                &quot;offlineRetention&quot;: &quot;0&quot;,&#xd;
                &quot;exportDttm&quot;: &quot;2019-06-27T00:00:00.000Z&quot;,&#xd;
                &quot;resptrackingCd&quot;: &quot;66558620301&quot;,&#xd;
                &quot;paymentMethod&quot;: &quot;BILL ME - BILL ME&quot;,&#xd;
                &quot;flBl&quot;: &quot;0&quot;,&#xd;
                &quot;flRecidivist&quot;: &quot;0&quot;,&#xd;
                &quot;flPostecipado&quot;: &quot;0&quot;,&#xd;
                &quot;flagScob&quot;: null,&#xd;
                &quot;skyScore&quot;: &quot;13&quot;,&#xd;
                &quot;equipamentRemoved&quot;: &quot;0&quot;,&#xd;
                &quot;digitalAccess&quot;: &quot;0&quot;,&#xd;
                &quot;attricted&quot;: &quot;0&quot;,&#xd;
                &quot;competition&quot;: &quot;1&quot;,&#xd;
                &quot;campaignName&quot;: &quot;CAMP13961&quot;&#xd;
            },&#xd;
            &quot;customer&quot;: {&#xd;
                &quot;endOfTerm&quot;: &quot;2019-07-31T00:00:00.000Z&quot;,&#xd;
                &quot;phone4&quot;: &quot;&quot;,&#xd;
                &quot;offer4&quot;: &quot;Combate 3 meses&quot;,&#xd;
                &quot;city&quot;: &quot;RIO DE JANEIRO&quot;,&#xd;
                &quot;offer1&quot;: &quot;12xR$30,00&quot;,&#xd;
                &quot;address&quot;: &quot;ESTR GALEAO 1450 203&quot;,&#xd;
                &quot;phone3&quot;: &quot;&quot;,&#xd;
                &quot;cpf&quot;: &quot;${__counter(TRUE,)}&quot;,&#xd;
                &quot;phone6&quot;: &quot;21 33939864&quot;,&#xd;
                &quot;state&quot;: &quot;RJ&quot;,&#xd;
                &quot;phone9&quot;: &quot;&quot;,&#xd;
                &quot;requestDate&quot;: &quot;2019-05-02T00:00:00.000Z&quot;,&#xd;
                &quot;zipCode&quot;: &quot;21931522&quot;,&#xd;
                &quot;offer3&quot;: &quot;Premiere HD 3 meses&quot;,&#xd;
                &quot;cancellationDate&quot;: &quot;2019-05-22T00:00:00.000Z&quot;,&#xd;
                &quot;installationDate&quot;: &quot;2011-07-21T00:00:00.000Z&quot;,&#xd;
                &quot;customerCode&quot;: &quot;76010760&quot;,&#xd;
                &quot;dsFirstMotivo&quot;: &quot;CONCORRENCIA - OUTROS&quot;,&#xd;
                &quot;name&quot;: &quot;NILO DE OLIVEIRA BARBOSA&quot;,&#xd;
                &quot;phone2&quot;: &quot;&quot;,&#xd;
                &quot;age&quot;: &quot;85&quot;,&#xd;
                &quot;cancellationType&quot;: &quot;0&quot;,&#xd;
                &quot;gender&quot;: &quot;MASCULINO&quot;,&#xd;
                &quot;phone5&quot;: &quot;&quot;,&#xd;
                &quot;phone8&quot;: &quot;&quot;,&#xd;
                &quot;offer5&quot;: &quot;Adulto SP 6 meses&quot;,&#xd;
                &quot;email&quot;: &quot;willian@mutantbr.com&quot;,&#xd;
                &quot;packageSegment&quot;: &quot;Gold&quot;,&#xd;
                &quot;phone10&quot;: &quot;&quot;,&#xd;
                &quot;package&quot;: &quot;COMBO FULL CINEMA HD 2018 - A&quot;,&#xd;
                &quot;offer2&quot;: &quot;6xR$60,00&quot;,&#xd;
                &quot;phone7&quot;: &quot;&quot;,&#xd;
                &quot;neighborhood&quot;: &quot;JARDIM CARIOCA&quot;,&#xd;
                &quot;phone1&quot;: &quot;11 973476977&quot;,&#xd;
                &quot;civilStatus&quot;: &quot;-2&quot;&#xd;
            }&#xd;
        },&#xd;
        &quot;version&quot;: 1&#xd;
    }</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${host}</stringProp>
          <stringProp name="HTTPSampler.port">${port}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">/bpmn/${id}/fire</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">false</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
          <stringProp name="HTTPSampler.response_timeout">${__P(timeout, 5000)}</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <boolProp name="useGroupName">true</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>